OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f86k22.h
/*
 * This declarations of the PIC18F86K22 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:39 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#ifndef __PIC18F86K22_H__
#define __PIC18F86K22_H__

//==============================================================================

//==============================================================================
//
//	Register Definitions
//
//==============================================================================


//==============================================================================
//        PMD3 Bits

extern __at(0x0F16) __sfr PMD3;

typedef struct
  {
  unsigned TMR12MD              : 1;
  unsigned CCP4MD               : 1;
  unsigned CCP5MD               : 1;
  unsigned CCP6MD               : 1;
  unsigned CCP7MD               : 1;
  unsigned CCP8MD               : 1;
  unsigned CCP9MD               : 1;
  unsigned CCP10MD              : 1;
  } __PMD3bits_t;

extern __at(0x0F16) volatile __PMD3bits_t PMD3bits;

#define _TMR12MD                0x01
#define _CCP4MD                 0x02
#define _CCP5MD                 0x04
#define _CCP6MD                 0x08
#define _CCP7MD                 0x10
#define _CCP8MD                 0x20
#define _CCP9MD                 0x40
#define _CCP10MD                0x80

//==============================================================================


//==============================================================================
//        PMD2 Bits

extern __at(0x0F17) __sfr PMD2;

typedef struct
  {
  unsigned CMP1MD               : 1;
  unsigned CMP2MD               : 1;
  unsigned CMP3MD               : 1;
  unsigned TMR5MD               : 1;
  unsigned TMR6MD               : 1;
  unsigned TMR7MD               : 1;
  unsigned TMR8MD               : 1;
  unsigned TMR10MD              : 1;
  } __PMD2bits_t;

extern __at(0x0F17) volatile __PMD2bits_t PMD2bits;

#define _CMP1MD                 0x01
#define _CMP2MD                 0x02
#define _CMP3MD                 0x04
#define _TMR5MD                 0x08
#define _TMR6MD                 0x10
#define _TMR7MD                 0x20
#define _TMR8MD                 0x40
#define _TMR10MD                0x80

//==============================================================================


//==============================================================================
//        PMD1 Bits

extern __at(0x0F18) __sfr PMD1;

typedef struct
  {
  unsigned EMBMD                : 1;
  unsigned TMR1MD               : 1;
  unsigned TMR2MD               : 1;
  unsigned TMR3MD               : 1;
  unsigned TMR4MD               : 1;
  unsigned RTCCMD               : 1;
  unsigned CTMUMD               : 1;
  unsigned PSPMD                : 1;
  } __PMD1bits_t;

extern __at(0x0F18) volatile __PMD1bits_t PMD1bits;

#define _EMBMD                  0x01
#define _TMR1MD                 0x02
#define _TMR2MD                 0x04
#define _TMR3MD                 0x08
#define _TMR4MD                 0x10
#define _RTCCMD                 0x20
#define _CTMUMD                 0x40
#define _PSPMD                  0x80

//==============================================================================


//==============================================================================
//        PMD0 Bits

extern __at(0x0F19) __sfr PMD0;

typedef struct
  {
  unsigned ADCMD                : 1;
  unsigned SSP1MD               : 1;
  unsigned SSP2MD               : 1;
  unsigned UART1MD              : 1;
  unsigned UART2MD              : 1;
  unsigned CCP1MD               : 1;
  unsigned CCP2MD               : 1;
  unsigned CCP3MD               : 1;
  } __PMD0bits_t;

extern __at(0x0F19) volatile __PMD0bits_t PMD0bits;

#define _ADCMD                  0x01
#define _SSP1MD                 0x02
#define _SSP2MD                 0x04
#define _UART1MD                0x08
#define _UART2MD                0x10
#define _CCP1MD                 0x20
#define _CCP2MD                 0x40
#define _CCP3MD                 0x80

//==============================================================================


//==============================================================================
//        PSTR3CON Bits

extern __at(0x0F1A) __sfr PSTR3CON;

typedef union
  {
  struct
    {
    unsigned STRA               : 1;
    unsigned STRB               : 1;
    unsigned STRC               : 1;
    unsigned STRD               : 1;
    unsigned STRSYNC            : 1;
    unsigned                    : 1;
    unsigned CMPL0              : 1;
    unsigned CMPL1              : 1;
    };

  struct
    {
    unsigned                    : 6;
    unsigned CMPL               : 2;
    };
  } __PSTR3CONbits_t;

extern __at(0x0F1A) volatile __PSTR3CONbits_t PSTR3CONbits;

#define _PSTR3CON_STRA          0x01
#define _PSTR3CON_STRB          0x02
#define _PSTR3CON_STRC          0x04
#define _PSTR3CON_STRD          0x08
#define _PSTR3CON_STRSYNC       0x10
#define _PSTR3CON_CMPL0         0x40
#define _PSTR3CON_CMPL1         0x80

//==============================================================================


//==============================================================================
//        PSTR2CON Bits

