OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f86k22.h
extern __at(0x0F84) volatile __PORTEbits_t PORTEbits;

#define _PORTE_RE0              0x01
#define _PORTE_AD8              0x01
#define _PORTE_P2D              0x01
#define _PORTE_NOT_RD           0x01
#define _PORTE_RE1              0x02
#define _PORTE_AD9              0x02
#define _PORTE_P2C              0x02
#define _PORTE_NOT_WR           0x02
#define _PORTE_RE2              0x04
#define _PORTE_AD10             0x04
#define _PORTE_P2B              0x04
#define _PORTE_CCP10            0x04
#define _PORTE_NOT_CS           0x04
#define _PORTE_RE3              0x08
#define _PORTE_AD11             0x08
#define _PORTE_P3C              0x08
#define _PORTE_CCP9             0x08
#define _PORTE_REFO             0x08
#define _PORTE_RE4              0x10
#define _PORTE_AD12             0x10
#define _PORTE_P3B              0x10
#define _PORTE_CCP8             0x10
#define _PORTE_RE5              0x20
#define _PORTE_AD13             0x20
#define _PORTE_P1C              0x20
#define _PORTE_CCP7             0x20
#define _PORTE_RE6              0x40
#define _PORTE_AD14             0x40
#define _PORTE_P1B              0x40
#define _PORTE_CCP6             0x40
#define _PORTE_RE7              0x80
#define _PORTE_AD15             0x80
#define _PORTE_P2A              0x80
#define _PORTE_CCP2             0x80

//==============================================================================


//==============================================================================
//        PORTF Bits

extern __at(0x0F85) __sfr PORTF;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned RF1                : 1;
    unsigned RF2                : 1;
    unsigned RF3                : 1;
    unsigned RF4                : 1;
    unsigned RF5                : 1;
    unsigned RF6                : 1;
    unsigned RF7                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned AN6                : 1;
    unsigned AN7                : 1;
    unsigned AN8                : 1;
    unsigned AN9                : 1;
    unsigned AN10               : 1;
    unsigned AN11               : 1;
    unsigned AN5                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned C2OUT              : 1;
    unsigned C1OUT              : 1;
    unsigned C2INB              : 1;
    unsigned C2INA              : 1;
    unsigned C1INB              : 1;
    unsigned C1INA              : 1;
    unsigned SS1                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned CTDIN              : 1;
    unsigned                    : 1;
    unsigned CTMUI              : 1;
    unsigned                    : 1;
    unsigned CVREF              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PORTFbits_t;

extern __at(0x0F85) volatile __PORTFbits_t PORTFbits;

#define _RF1                    0x02
#define _AN6                    0x02
#define _C2OUT                  0x02
#define _CTDIN                  0x02
#define _RF2                    0x04
#define _AN7                    0x04
#define _C1OUT                  0x04
#define _RF3                    0x08
#define _AN8                    0x08
#define _C2INB                  0x08
#define _CTMUI                  0x08
#define _RF4                    0x10
#define _AN9                    0x10
#define _C2INA                  0x10
#define _RF5                    0x20
#define _AN10                   0x20
#define _C1INB                  0x20
#define _CVREF                  0x20
#define _RF6                    0x40
#define _AN11                   0x40
#define _C1INA                  0x40
#define _RF7                    0x80
#define _AN5                    0x80
#define _SS1                    0x80

//==============================================================================


//==============================================================================
//        PORTG Bits

extern __at(0x0F86) __sfr PORTG;

typedef union
  {
  struct
    {
    unsigned RG0                : 1;
    unsigned RG1                : 1;
    unsigned RG2                : 1;
    unsigned RG3                : 1;
    unsigned RG4                : 1;
    unsigned RG5                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP3               : 1;
    unsigned C3OUT              : 1;
    unsigned C3INA              : 1;
    unsigned C3INB              : 1;
    unsigned C3INC              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PA3                : 1;
    unsigned TX2                : 1;
    unsigned RX2                : 1;
    unsigned PD3                : 1;
    unsigned PD1                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned AN19               : 1;
    unsigned AN18               : 1;
    unsigned AN17               : 1;
    unsigned AN16               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned CK2                : 1;
    unsigned DT2                : 1;
    unsigned CCP4               : 1;
    unsigned CCP5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T7CKI              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T5G                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned RTCC               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RG                 : 6;
    unsigned                    : 2;
    };
  } __PORTGbits_t;

extern __at(0x0F86) volatile __PORTGbits_t PORTGbits;

#define _RG0                    0x01
#define _CCP3                   0x01
#define _PA3                    0x01
#define _RG1                    0x02
#define _C3OUT                  0x02
#define _TX2                    0x02
#define _AN19                   0x02
#define _CK2                    0x02
#define _RG2                    0x04
#define _C3INA                  0x04
#define _RX2                    0x04
#define _AN18                   0x04
#define _DT2                    0x04
#define _RG3                    0x08
#define _C3INB                  0x08
#define _PD3                    0x08
#define _AN17                   0x08
#define _CCP4                   0x08
#define _RG4                    0x10
#define _C3INC                  0x10
#define _PD1                    0x10
#define _AN16                   0x10
#define _CCP5                   0x10
#define _T7CKI                  0x10
#define _T5G                    0x10
#define _RTCC                   0x10
#define _RG5                    0x20

//==============================================================================


//==============================================================================
//        PORTH Bits

extern __at(0x0F87) __sfr PORTH;

typedef union
  {
  struct
    {
    unsigned RH0                : 1;
    unsigned RH1                : 1;
    unsigned RH2                : 1;
    unsigned RH3                : 1;
    unsigned RH4                : 1;
    unsigned RH5                : 1;
    unsigned RH6                : 1;
    unsigned RH7                : 1;
    };

  struct
    {
    unsigned AN23               : 1;
    unsigned AN22               : 1;
    unsigned AN21               : 1;
    unsigned AN20               : 1;
    unsigned AN12               : 1;
    unsigned AN13               : 1;
    unsigned AN14               : 1;
    unsigned AN15               : 1;
    };

  struct
    {
    unsigned A16                : 1;
    unsigned A17                : 1;
    unsigned A18                : 1;
    unsigned A19                : 1;
    unsigned CCP9               : 1;
    unsigned CCP8               : 1;
    unsigned CCP7               : 1;
    unsigned CCP6               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PC3                : 1;
    unsigned PB3                : 1;
    unsigned PC1                : 1;
    unsigned PB1                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned C2INC              : 1;
    unsigned C2IND              : 1;
    unsigned C1INC              : 1;
    unsigned                    : 1;
    };
  } __PORTHbits_t;

extern __at(0x0F87) volatile __PORTHbits_t PORTHbits;

